#!/bin/bash

echo "================================="
echo "=== Сборка образа базы данных ==="
echo "================================="
cd ./docker/dbms
./dimage.bash

echo "========================================="
echo "=== Сборка образа генератора запросов ==="
echo "========================================="
cd ../sql-query-generator
./dimage.bash

cd ../..

echo "========================================"
echo "=== Сборка образа основной программы ==="
echo "========================================"
./dimage.bash